# Pandas

In [15]:
import pandas as pd

In [17]:
import numpy as np

# DataFrame 생성

In [7]:
s1=pd.Series([4000,20000, 10000],
            index=['2020-06-15', '2020-06-16', '2020-06-17'])
s2=pd.Series([5000,8000,11000],
            index=['2020-06-15', '2020-06-16', '2020-06-17'])
s3=pd.Series([6000,9000,12000],
            index=['2020-06-15', '2020-06-16', '2020-06-17'])
df=pd.DataFrame([s1,s2,s3])
df
#series 객체 하나가 하나의 행으로 들어감.(row)
#갯수가 서로 맞아야 함.

   2020-06-15  2020-06-16  2020-06-17
0        4000       20000       10000
1        5000        8000       11000
2        6000        9000       12000

In [9]:
indexs=['name','kor','eng','sci']
hong=pd.Series(['hong',50,50,50], index=indexs)
kim=pd.Series(['kim',90,90,90], index=indexs)
lee=pd.Series(['lee',70,70,70], index=indexs)
df=pd.DataFrame([hong,kim,lee], index=[1,2,3])
df

   name  kor  eng  sci
1  hong   50   50   50
2   kim   90   90   90
3   lee   70   70   70

In [10]:
df.index

Int64Index([1, 2, 3], dtype='int64')

In [11]:
df.columns

Index(['name', 'kor', 'eng', 'sci'], dtype='object')

In [12]:
df.values

array([['hong', 50, 50, 50],
       ['kim', 90, 90, 90],
       ['lee', 70, 70, 70]], dtype=object)

In [20]:
data=np.array([[10,20,30,40],[100,200,300,400]])
index_list=pd.date_range('2020-06-15',periods=2)
col_list=['A', 'B','C','D']
df=pd.DataFrame(data, index=index_list,columns=col_list)
df

              A    B    C    D
2020-06-15   10   20   30   40
2020-06-16  100  200  300  400

In [21]:
df.index

DatetimeIndex(['2020-06-15', '2020-06-16'], dtype='datetime64[ns]', freq='D')

In [22]:
df.values

array([[ 10,  20,  30,  40],
       [100, 200, 300, 400]])

In [23]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

### DataFrame의 행 인덱스 또는 열 이름 변경   

-rename()메서드 사용   
-원본 객체 변경 시에는 inplace=True 옵션 사용. 이거 안쓰면 rename함수 쓸 때만 동작하게 됨. 실제 데이터 프레임에 발현x

In [34]:
df=pd.DataFrame([[50,50,50], [90,90,90],[70,70,70] ],
            index=['hong','kim','lee'],
            columns=['kor','eng','sci'])
df

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [35]:
df2=df[:] #dataframe 복사
df2

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [36]:
df2.rename(columns={'kor':'subject1',
                   'eng':'subject2',
                   'sci':'subject3'}, inplace=True)

In [37]:
df2

      subject1  subject2  subject3
hong        50        50        50
kim         90        90        90
lee         70        70        70

In [38]:
df2

      subject1  subject2  subject3
hong        50        50        50
kim         90        90        90
lee         70        70        70

In [39]:
df

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [40]:
df2.rename(index={'hong':'hong gil dong',
                 'kim':'kim gil dong',
                 'lee': 'lee gil dong'})

               subject1  subject2  subject3
hong gil dong        50        50        50
kim gil dong         90        90        90
lee gil dong         70        70        70

In [41]:
df2

      subject1  subject2  subject3
hong        50        50        50
kim         90        90        90
lee         70        70        70

### 행/열 삭제   
-DataFrame의 행/열 삭제는 drop()메서드 사용   
-행을 삭제할 때는 축(axis)옵션으로 axis=0을 입력하거나, 별도로 입력하지 않는다.   
-축(axis)옵션으로 axis=1은 열을 삭제할 때 부여한다.   
-동시에 여러개의 행 또는 열을 삭제하려면 리스트 형태로 입력한다.   
-원본 객체 변경 시에는 inplace=True 옵션 사용

In [48]:
df2.drop('lee', inplace=True)

KeyError: "['lee'] not found in axis"

In [47]:
df2

      subject1  subject2  subject3
hong        50        50        50
kim         90        90        90

In [49]:
df2.drop('subject3',axis=1, inplace=True)
df2

      subject1  subject2
hong        50        50
kim         90        90

In [50]:
#축을 정해주는 것으로 행을 지울 것인지 열을 지울 것인지 결정 가능.

In [52]:
df2=df[:]
df2

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [53]:
df2.drop(['hong','lee'])

     kor  eng  sci
kim   90   90   90

In [54]:
df2.drop(['kor','eng'],axis=1)

      sci
hong   50
kim    90
lee    70

### 행 선택   
-DataFrame의 행 데이터를 선택하기 위해서는 loc와 iloc 인덱서를 사용한다.   
-인덱스 이름을 기준으로 행을 선택할 때는 loc 사용한다.  
-정수형 위치 인텍스를 사용할 때는 iloc 사용한다.

In [55]:
df2.iloc[0]

kor    50
eng    50
sci    50
Name: hong, dtype: int64

In [56]:
df2.loc['hong']

kor    50
eng    50
sci    50
Name: hong, dtype: int64

In [57]:
df2.iloc[[0,2]]

      kor  eng  sci
hong   50   50   50
lee    70   70   70

In [58]:
df2.loc[['hong','kim']]

      kor  eng  sci
hong   50   50   50
kim    90   90   90

In [59]:
df2.loc['hong':'lee']

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

### 열 선택   
-DataFrame의 열 데이터를 한 개만 선택할 때는, []안에 열 이름을 '또는 "와 함께 입력하거나 도트(.) 다음에 열 이름을 입력하는 두 가지 방식이 있다.  
-도트(.)를 사용하는 방식에서는 반드시 열 이름이 문자열일 경우만 가능하다.   
-열 한개만 선택하면 시리즈 객체가 반환된다.   
-[]안에 열 이름의 리스트를 입력하면 리스트의 원소인 열을 모두 선택하여 DataFrame으로 반환한다.

In [60]:
df2['kor']

hong    50
kim     90
lee     70
Name: kor, dtype: int64

In [61]:
df2.kor

hong    50
kim     90
lee     70
Name: kor, dtype: int64

In [62]:
df2[['kor','sci']]

      kor  sci
hong   50   50
kim    90   90
lee    70   70

In [63]:
df2[['sci']]

      sci
hong   50
kim    90
lee    70

#### 범위 슬라이싱을 이용한 행 선택

In [64]:
df2.iloc[::2]

      kor  eng  sci
hong   50   50   50
lee    70   70   70

In [65]:
df2.iloc[::-1]

      kor  eng  sci
lee    70   70   70
kim    90   90   90
hong   50   50   50

In [66]:
df2.iloc[0:3:2]

      kor  eng  sci
hong   50   50   50
lee    70   70   70

### 요소 선택

DataFrame의 행 인덱스와 열 이름을 [행, 열]형식의 2차원 좌표로 입력하여 요소 위치를 지정하는 방법이다.  
1개의 행과 2개 이상의 열을 선택하거나, 2개 이상의 행과 1개의 열을 선택하는 경우 Series 객체가 반환된다.   
2개 이상의 행과 2개 이상의 열을 선택하면, DataFrame 객체를 반환한다.

In [67]:
df2

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [68]:
df2.iloc[0,0]

50

In [71]:
df2.iloc[1,0]

90

In [72]:
df2.loc['hong','kor']

50

In [73]:
df2.loc['kim','kor']

90

In [74]:
df2.iloc[0,[2,1]]

sci    50
eng    50
Name: hong, dtype: int64

In [76]:
df2.loc['hong',['sci','eng']]

sci    50
eng    50
Name: hong, dtype: int64

In [77]:
df2.iloc[[0,2],[2,0]]

      sci  kor
hong   50   50
lee    70   70

In [78]:
df2.loc[['kim','hong'],['kor','eng']]

      kor  eng
kim    90   90
hong   50   50

In [79]:
df2.loc['hong':'kim','kor':'eng']

      kor  eng
hong   50   50
kim    90   90

In [81]:
df2=df[:]
df2

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [82]:
df2.iloc[0,0]=55
df2

      kor  eng  sci
hong   55   50   50
kim    90   90   90
lee    70   70   70

In [85]:
df2.loc[['hong','kim'],['eng','sci']]=90
df2

      kor  eng  sci
hong   55   90   90
kim    90   90   90
lee    70   70   70

### 열 추가

In [86]:
df2=df[:]
df2

      kor  eng  sci
hong   55   90   90
kim    90   90   90
lee    70   70   70

In [87]:
df2['math']=88
df2

C:\python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

      kor  eng  sci  math
hong   55   90   90    88
kim    90   90   90    88
lee    70   70   70    88

In [88]:
df2['math2']=[59,92,81]
df2

C:\python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

      kor  eng  sci  math  math2
hong   55   90   90    88     59
kim    90   90   90    88     92
lee    70   70   70    88     81

### 행 추가

-추가하려는 행이름과 데이터 값을 loc 인덱서를 사용하여 입력한다.   
-하나의 데이터 값을 입력하거나, 열의 개수에 맞게 데이터를 입력하여 추가한다.

In [89]:
df2.loc[3]=0
df2

C:\python\anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

      kor  eng  sci  math  math2
hong   55   90   90    88     59
kim    90   90   90    88     92
lee    70   70   70    88     81
3       0    0    0     0      0

In [90]:
df2.loc['park']=[78,72,71,75,74]
df2

C:\python\anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

      kor  eng  sci  math  math2
hong   55   90   90    88     59
kim    90   90   90    88     92
lee    70   70   70    88     81
3       0    0    0     0      0
park   78   72   71    75     74

In [91]:
#250? 256?

### Series/DataFrame 연산

In [97]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([10,20,30,40,50])

In [98]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [99]:
s2

0    10
1    20
2    30
3    40
4    50
dtype: int64

### Series와 scalar간 연산(사칙연산 가능)

In [100]:
s1*5

0     5
1    10
2    15
3    20
4    25
dtype: int64

In [101]:
s1/2

0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
dtype: float64

### Series와 Series간 연산(사칙연산 가능)

In [102]:
#iterator(반복자)-반복기능을 수행하는 object. 자체에 반복 기능 요소 있음.

In [103]:
s1+s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [104]:
s2/s1

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [105]:
s1=pd.Series({'kor':50, 'eng':70, 'sci':90})
s1

kor    50
eng    70
sci    90
dtype: int64

In [106]:
s2=pd.Series({'sci':77,'kor':52,'eng':30})
s2

sci    77
kor    52
eng    30
dtype: int64

In [107]:
s1+s2

eng    100
kor    102
sci    167
dtype: int64

In [108]:
#인덱스 값이 같은 게 있으면 순서가 달라도 연산이 된다.

In [109]:
s1=pd.Series({'kor': 50, 'eng':30, 'sci':90})
s1

kor    50
eng    30
sci    90
dtype: int64

In [110]:
s2=pd.Series({'sci':95,'kor':80,'math':72})
s2

sci     95
kor     80
math    72
dtype: int64

In [111]:
s1+s2

eng       NaN
kor     130.0
math      NaN
sci     185.0
dtype: float64

In [112]:
#서로 없는 게 있는 series끼리의 연산->있는 것은 서로 계산되나 없는 건 결측치로 처리됨.

In [114]:
s1.add(s2, fill_value=0) #연산 메소드, fill_value 인수: nan을 대체할 값

eng      30.0
kor     130.0
math     72.0
sci     185.0
dtype: float64

In [ ]:
#없으면 0으로 대체하라고 해서 있는 것+0이 되어서 nan이 없어짐.

### DataFrame과 Series간 연산

In [115]:
data={'kor':[50,90,70],'eng':[50,90,70],'sci':[50,90,70]}
index_list=['hong','kim','lee']
df=pd.DataFrame(data,index=index_list)
df

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [116]:
df+10

      kor  eng  sci
hong   60   60   60
kim   100  100  100
lee    80   80   80

### DataFrame과 DataFrame간 연산

In [117]:
data={'kor':[50,90,70],'eng':[50,90,70], 'math':[50,90,70]}

In [ ]:
#놓침

In [ ]:
#251 254

### DataFrame에 적용하는 함수(분석 시 활용)

In [118]:
import seaborn as sns

In [119]:
iris=sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [122]:
iris.info() #data frame 요약정보 확인.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [124]:
iris.shape #data frame 차원정보

(150, 5)

In [125]:
iris.head() #dataframe 처음부터 일부 data 출력

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [126]:
iris.tail() #dataframe 마지막 부분 일부 data 출력

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [128]:
iris.describe() #dataframe에대한 기술 통계정보 출력

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [129]:
df

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [130]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, hong to lee
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     3 non-null      int64
 1   eng     3 non-null      int64
 2   sci     3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

object.arrtibe     
object.method()   

np.Variable   
np.Function    

--   
 |    
(library,module,package,)aliace

In [131]:
df.head()

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [133]:
df.describe()

        kor   eng   sci
count   3.0   3.0   3.0
mean   70.0  70.0  70.0
std    20.0  20.0  20.0
min    50.0  50.0  50.0
25%    60.0  60.0  60.0
50%    70.0  70.0  70.0
75%    80.0  80.0  80.0
max    90.0  90.0  90.0

In [134]:
iris.count() #각 열(변수)의 개수

sepal_length    150
sepal_width     150
petal_length    150
petal_width     150
species         150
dtype: int64

In [135]:
iris['sepal_length'].value_counts() #각 열(변수)의 고유값 개수

5.0    10
6.3     9
5.1     9
6.7     8
5.7     8
5.5     7
5.8     7
6.4     7
6.0     6
4.9     6
6.1     6
5.4     6
5.6     6
6.5     5
4.8     5
7.7     4
6.9     4
5.2     4
6.2     4
4.6     4
7.2     3
6.8     3
4.4     3
5.9     3
6.6     2
4.7     2
7.6     1
7.4     1
4.3     1
7.9     1
7.3     1
7.0     1
4.5     1
5.3     1
7.1     1
Name: sepal_length, dtype: int64

In [136]:
df['kor'].value_counts()

70    1
50    1
90    1
Name: kor, dtype: int64

### 통계 함수

In [137]:
iris.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [138]:
iris['sepal_length'].mean()

5.843333333333335

In [139]:
iris.median() #중간값

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

In [140]:
iris['sepal_length'].median()

5.8

In [141]:
iris.max() #최대값

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [142]:
iris['sepal_length'].max()

7.9

In [143]:
iris.min() #최소값

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [144]:
iris['sepal_length'].min()

4.3

In [145]:
iris.std() #표준편차

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

In [146]:
iris['sepal_length'].std()

0.8280661279778629

In [147]:
iris.corr() #상관 계수

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

In [148]:
iris[['sepal_length','petal_length']].corr()

              sepal_length  petal_length
sepal_length      1.000000      0.871754
petal_length      0.871754      1.000000

In [149]:
df.T

     hong  kim  lee
kor    50   90   70
eng    50   90   70
sci    50   90   70

In [150]:
df

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [ ]:
#255 267

### 기술 통계 및 요약 통계 메소드   
|메서드|설명|
|------|----|
|count()|nan값을 제외한 값의 수 반환|
|describe()|Series/dataframe 각 열에 대한 요약 통계|
|min(),max()|최소, 최대값|
|argmin(),argmax()|최소, 최대값을 가지고 있는 색인의 값 반환|
|idxmin(),idxmax()|최소, 최대값을 갖고 있는 색인의 값 반환|
|quantile()|사분위수 계산|
|sum()|합|
|mean()|평균|
|median()|중위값|
|mad()|평균값에서 절대 평균편차|
|var()|표본 분산|
|std()|표본 정규분산|
|skew()|표본 비대칭도|
|kurt()|표본 첨도|
|cumsum()|누적합|
|cummin(),cummax()|누적 최소값, 누적 최대값|
|cumprod()|누적곱|
|diff()|1차 산술식(시계열 데이터 사용시 유용)|
|pct_change|퍼센트 변화율 계산|
|corr()|상관계수|
|cov()|공분산|
|corrwith(dt,col)|다른 Series나 dataframe과의 상관계수 ex)df.corwith(df.age)|

### 정렬

In [151]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [152]:
iris.sort_values(by='petal_width', ascending=True).head()

    sepal_length  sepal_width  petal_length  petal_width species
32           5.2          4.1           1.5          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
37           4.9          3.6           1.4          0.1  setosa
9            4.9          3.1           1.5          0.1  setosa
12           4.8          3.0           1.4          0.1  setosa

In [155]:
iris.sort_values(by='petal_width', ascending=False).head() #by=는 sort할 기준열을 설정하는 것.

     sepal_length  sepal_width  petal_length  petal_width    species
100           6.3          3.3           6.0          2.5  virginica
109           7.2          3.6           6.1          2.5  virginica
144           6.7          3.3           5.7          2.5  virginica
114           5.8          2.8           5.1          2.4  virginica
140           6.7          3.1           5.6          2.4  virginica

In [156]:
iris.sort_values(by=['petal_width','sepal_length'], ascending=False).head() #기준열을 두개도 설정 가능.

     sepal_length  sepal_width  petal_length  petal_width    species
109           7.2          3.6           6.1          2.5  virginica
144           6.7          3.3           5.7          2.5  virginica
100           6.3          3.3           6.0          2.5  virginica
140           6.7          3.1           5.6          2.4  virginica
136           6.3          3.4           5.6          2.4  virginica

In [157]:
iris.sort_index(ascending=False).head()  #인덱스를 가지고 sort.

     sepal_length  sepal_width  petal_length  petal_width    species
149           5.9          3.0           5.1          1.8  virginica
148           6.2          3.4           5.4          2.3  virginica
147           6.5          3.0           5.2          2.0  virginica
146           6.3          2.5           5.0          1.9  virginica
145           6.7          3.0           5.2          2.3  virginica

In [158]:
df

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [159]:
df.sort_index(ascending=False)

      kor  eng  sci
lee    70   70   70
kim    90   90   90
hong   50   50   50

### 데이터 전처리(Data Preprocessing)   
-결측치 처리

In [161]:
data={'20200301':[50,np.nan,90,70,80],
     '20200302':[70,80,92,79,88],
     '20200305':[92,np.nan,77,np.nan,99],
     '20200304':[82,95,100,87,65],
     '20200303':[77,76,72,71,79]}
df=pd.DataFrame(data)
df

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
1       NaN        80       NaN        95        76
2      90.0        92      77.0       100        72
3      70.0        79       NaN        87        71
4      80.0        88      99.0        65        79

In [162]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   20200301  4 non-null      float64
 1   20200302  5 non-null      int64
 2   20200305  3 non-null      float64
 3   20200304  5 non-null      int64
 4   20200303  5 non-null      int64
dtypes: float64(2), int64(3)
memory usage: 328.0 bytes

In [163]:
df['20200301'].value_counts()

80.0    1
70.0    1
90.0    1
50.0    1
Name: 20200301, dtype: int64

In [165]:
df['20200301'].value_counts(dropna=False) #dropna를 통해 결측치 제거 안하고 그대로 나오게 함. 결측치 파악 용이

80.0    1
70.0    1
90.0    1
NaN     1
50.0    1
Name: 20200301, dtype: int64

In [166]:
df['20200305'].value_counts()

99.0    1
77.0    1
92.0    1
Name: 20200305, dtype: int64

In [167]:
df['20200305'].value_counts(dropna=False) #결측치 포함 고유값 계산

NaN     2
99.0    1
77.0    1
92.0    1
Name: 20200305, dtype: int64

In [168]:
df.head().isnull() #null(결측치, 누락값) 유무 확인, null이면 True

   20200301  20200302  20200305  20200304  20200303
0     False     False     False     False     False
1      True     False      True     False     False
2     False     False     False     False     False
3     False     False      True     False     False
4     False     False     False     False     False

In [171]:
df.head().isnull().sum(axis=1) #행별 null의 개수 계산

0    0
1    2
2    0
3    1
4    0
dtype: int64

In [172]:
df.head().isnull().sum() #열별 null의 개수 계산

20200301    1
20200302    0
20200305    2
20200304    0
20200303    0
dtype: int64

In [175]:
df.head().notnull() #null이 아니면 True

   20200301  20200302  20200305  20200304  20200303
0      True      True      True      True      True
1     False      True     False      True      True
2      True      True      True      True      True
3      True      True     False      True      True
4      True      True      True      True      True

In [176]:
df2=df[:]

### 결측치 제거
-dropna() 메서드 사용

In [177]:
df2.dropna() #결측치 삭제(행을 삭제)

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
2      90.0        92      77.0       100        72
4      80.0        88      99.0        65        79

In [182]:
nan_list=df2.dropna()#삭제된 데이터 return
nan_list

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
2      90.0        92      77.0       100        72
4      80.0        88      99.0        65        79

In [183]:
df2.dropna(axis=1) #결측치 삭제(열을 삭제)

   20200302  20200304  20200303
0        70        82        77
1        80        95        76
2        92       100        72
3        79        87        71
4        88        65        79

In [184]:
df2.dropna(axis=1,thresh=1) #thresh: 정해진 수 이상의 nan일때만 삭제

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
1       NaN        80       NaN        95        76
2      90.0        92      77.0       100        72
3      70.0        79       NaN        87        71
4      80.0        88      99.0        65        79

In [178]:
df2

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
1       NaN        80       NaN        95        76
2      90.0        92      77.0       100        72
3      70.0        79       NaN        87        71
4      80.0        88      99.0        65        79

In [185]:
#subset:결측치 파악 변수  how:'any' :결측치가 하나라도 있으면 /'all':모든 데이터가 결측치이면
cnt=df2.dropna(subset=['20200305'], how='any',axis=0)

In [186]:
cnt

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
2      90.0        92      77.0       100        72
4      80.0        88      99.0        65        79

In [187]:
cnt=df2.dropna(subset=['20200305'], how='all',axis=0)

In [188]:
cnt

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
2      90.0        92      77.0       100        72
4      80.0        88      99.0        65        79

### 결측치 값을 다른 값으로 대체   
-fillna()메서드 이용

In [189]:
df2

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
1       NaN        80       NaN        95        76
2      90.0        92      77.0       100        72
3      70.0        79       NaN        87        71
4      80.0        88      99.0        65        79

In [194]:
mean_20200301=df2['20200301'].mean(axis=0)
mean_20200305=df2['20200305'].mean(axis=0)
mean_20200301,mean_20200305

(72.5, 89.33333333333333)

In [207]:
#결측치가 있는 열의 평균값으로 결측치를 대체
df2['20200301'].fillna(mean_20200301,inplace=True)
df2['20200305'].fillna(mean_20200305,inplace=True)

In [208]:
df2

   20200301  20200302   20200305  20200304  20200303
0      50.0        70  92.000000        82        77
1      72.5        80  89.333333        95        76
2      90.0        92  77.000000       100        72
3      70.0        79  89.333333        87        71
4      80.0        88  99.000000        65        79

In [209]:
df2.loc[1,'20200305']=np.nan

In [210]:
df2 #중간에 뭐 빠진 듯하니 재확인할 것.

   20200301  20200302   20200305  20200304  20200303
0      50.0        70  92.000000        82        77
1      72.5        80        NaN        95        76
2      90.0        92  77.000000       100        72
3      70.0        79  89.333333        87        71
4      80.0        88  99.000000        65        79

In [211]:
max_20200305=df['20200305'].value_counts(dropna=True).idxmax()
max_20200305

89.33333333333333

In [212]:
df2.fillna(max_20200305,inplace=True) #결측치가 있는 열의 가장 큰 값으로 대체

In [213]:
#이거 졸라게 꼬였으니까 수업 교재 보고 확인 할 것.

In [214]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [215]:
iris.loc[1,'sepal_length']=np.nan

In [216]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           NaN          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [219]:
#결측치가 포함된 행 이전행의 값으로 대체
iris['sepal_length'].fillna(method='ffill', inplace=True)

In [220]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           5.1          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

### 중복 데이터 처리

In [228]:
df=pd.DataFrame({'A':['a','a','b','a','b'],\
               'B':[1,1,1,2,2],
               'C':[1,1,2,2,2]})
df

   A  B  C
0  a  1  1
1  a  1  1
2  b  1  2
3  a  2  2
4  b  2  2

In [224]:
dup=df.duplicated() #중복 데이터 확인(행)
dup

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [227]:
dup=df['B'].duplicated() #중복 데이터 확인(열) b 기준으로.
dup
#처음 나온 값은 중복으로 안봄. 즉 그 뒤로 나오면 중복으로 간주.

0    False
1     True
2     True
3    False
4     True
Name: B, dtype: bool

In [229]:
df=df.drop_duplicates()
df

   A  B  C
0  a  1  1
2  b  1  2
3  a  2  2
4  b  2  2